app/controllers/comments_controller.rb

  def create
  	  @post = Post.find(params[:post_id])
    @comment = @post.comments.create(comment_params)
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ? LIMIT 1  [["id", 4]]
INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?)  [["body", "my first comment"], ["created_at", "2015-01-29 02:11:07.876656"], ["post_id", 1], ["updated_at", "2015-01-29 02:11:07.876656"]]

  def update
    respond_to do |format|
      if @comment.update(comment_params)
---
UPDATE "comments" SET "body" = ?, "updated_at" = ? WHERE "comments"."id" = 1  [["body", "my first comment here"], ["updated_at", "2015-01-29 02:11:24.067788"]]

  def destroy
    @comment.destroy
---
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]