app/controllers/posts_controller.rb

INSERT INTO "posts" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "Hello My first post"], ["created_at", "2015-01-29 02:10:41.330144"], ["title", "First Post"], ["updated_at", "2015-01-29 02:10:41.330144"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save